# Create DF
in different ways

In [2]:
import numpy as np
import pandas as pd

In [137]:
## DF from strings
#nos = np.array(np.arange(1,50,1))
nos = [1,2,3,4,5]
print(type(nos), '\n', nos)
nos2 = [str(item).zfill(3) for item in nos]
print(type(nos1), '\n',nos1)

<class 'list'>
 [1, 2, 3, 4, 5]
<class 'list'>
 ['1', '2', '3', '4', '5']

In [105]:
prefix = 'A'
rollno = [prefix + str(i) for i in range(1, 50,1)]
print(rollno)

['A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9', 'A10', 'A11', 'A12', 'A13', 'A14', 'A15', 'A16', 'A17', 'A18', 'A19', 'A20', 'A21', 'A22', 'A23', 'A24', 'A25', 'A26', 'A27', 'A28', 'A29', 'A30', 'A31', 'A32', 'A33', 'A34', 'A35', 'A36', 'A37', 'A38', 'A39', 'A40', 'A41', 'A42', 'A43', 'A44', 'A45', 'A46', 'A47', 'A48', 'A49']

In [148]:
prefix = 'A'
rollno2 = [prefix + str(i) for i in nos2]
print(rollno2)

['A001', 'A002', 'A003', 'A004', 'A005']

## Product1

In [4]:
# From Product like expand in R
a = np.linspace(1,5,2)
b = np.linspace(0,8,3)
print(a ,'\t', b)

[1. 5.] 	 [0. 4. 8.]

In [9]:
df1 = pd.MultiIndex.from_product([a, b]).to_frame()
df1.head

<bound method NDFrame.head of            0    1
1.0 0.0  1.0  0.0
    4.0  1.0  4.0
    8.0  1.0  8.0
5.0 0.0  5.0  0.0
    4.0  5.0  4.0
    8.0  5.0  8.0>

In [29]:
df1 = pd.MultiIndex.from_product([a, b], names=['a','b']).to_frame(index=False)
print(df1)

     a    b
0  1.0  0.0
1  1.0  4.0
2  1.0  8.0
3  5.0  0.0
4  5.0  4.0
5  5.0  8.0

In [31]:
df1.rename(columns = {'a':'colA', 'b':'colB'}, inplace=True)
df1.head()

   colA  colB
0   1.0   0.0
1   1.0   4.0
2   1.0   8.0
3   5.0   0.0
4   5.0   4.0

## Product 2

In [149]:
rollno = [1,2,3,4,5]
course = ['C','R','Python','Java']
df2 = pd.MultiIndex.from_product([rollno, course], 
                names=['rollno', 'course']).to_frame(index=False)
df2.head()

   rollno  course
0       1       C
1       1       R
2       1  Python
3       1    Java
4       2       C

In [28]:
df2['marks'] = np.random.randint(50,100, df2.shape[0])
df2.head()

   rollno  course  marks
0       1       C     76
1       1       R     70
2       1  Python     54
3       1    Java     73
4       2       C     87

## Header
First create headers (columns and sub Columns) and then add data
Then stack or unstack them

In [46]:
header = pd.MultiIndex.from_product([['Sem1','Sem2'],['Subject1','Subject2']])
print(type(header), '\n',header , '\n')

<class 'pandas.core.indexes.multi.MultiIndex'>
 MultiIndex([('Sem1', 'Subject1'),
            ('Sem1', 'Subject2'),
            ('Sem2', 'Subject1'),
            ('Sem2', 'Subject2')],
           )

In [47]:
#data
data =([[12,45,67,56], [78,89,45,67], [45,67,89,90], [67,44,56,55]])
print(type(data), '\n', data, '\n', np.array(data).shape)
# 4 rows and 4 columns ie 4 students rows

<class 'list'>
 [[12, 45, 67, 56], [78, 89, 45, 67], [45, 67, 89, 90], [67, 44, 56, 55]]
 (4, 4)

In [48]:
# index
rollno = ['A01','A02','A03','A04']

In [50]:
# connect them
df1 = pd.DataFrame(data, index = rollno, columns = header)
print(df1)
# Column Index : Level -1 = Sem1, Level-2 = Sem2

        Sem1              Sem2
    Subject1 Subject2 Subject1 Subject2
A01       12       45       67       56
A02       78       89       45       67
A03       45       67       89       90
A04       67       44       56       55

In [51]:
df1.stack()  # rotate the data
column index to row index

              Sem1  Sem2
A01 Subject1    12    67
    Subject2    45    56
A02 Subject1    78    45
    Subject2    89    67
A03 Subject1    45    89
    Subject2    67    90
A04 Subject1    67    56
    Subject2    44    55

In [52]:
df1.stack().unstack() # stack - unstack = same as original

        Sem1              Sem2
    Subject1 Subject2 Subject1 Subject2
A01       12       45       67       56
A02       78       89       45       67
A03       45       67       89       90
A04       67       44       56       55

In [59]:
# Level wise stacking
df1L0 = df1.stack(level=0)  # rotate the semester (Sem1 & Sem2)
print(df1L0)

          Subject1  Subject2
A01 Sem1        12        45
    Sem2        67        56
A02 Sem1        78        89
    Sem2        45        67
A03 Sem1        45        67
    Sem2        89        90
A04 Sem1        67        44
    Sem2        56        55

In [60]:
df1L1 = df1.stack(level=1)  # rotate the subjects (Subject1 & Subject2)
print(df1L1)

              Sem1  Sem2
A01 Subject1    12    67
    Subject2    45    56
A02 Subject1    78    45
    Subject2    89    67
A03 Subject1    45    89
    Subject2    67    90
A04 Subject1    67    56
    Subject2    44    55

In [64]:
df1L1.reset_index() # bring index to columns

  level_0   level_1  Sem1  Sem2
0     A01  Subject1    12    67
1     A01  Subject2    45    56
2     A02  Subject1    78    45
3     A02  Subject2    89    67
4     A03  Subject1    45    89
5     A03  Subject2    67    90
6     A04  Subject1    67    56
7     A04  Subject2    44    55

In [69]:
print(df1L1.index.get_level_values(0)) # rollno
print(df1L1.index.get_level_values(1))  #subject

Index(['A01', 'A01', 'A02', 'A02', 'A03', 'A03', 'A04', 'A04'], dtype='object')
Index(['Subject1', 'Subject2', 'Subject1', 'Subject2', 'Subject1', 'Subject2',
       'Subject1', 'Subject2'],
      dtype='object')

In [72]:
df1L1.reset_index(drop=False).groupby(by=['level_1']).count()

          level_0  Sem1  Sem2
level_1
Subject1        4     4     4
Subject2        4     4     4

In [74]:
df1L1.reset_index(level=1)   #reset only 1 index columns

      level_1  Sem1  Sem2
A01  Subject1    12    67
A01  Subject2    45    56
A02  Subject1    78    45
A02  Subject2    89    67
A03  Subject1    45    89
A03  Subject2    67    90
A04  Subject1    67    56
A04  Subject2    44    55

In [77]:
df1L1B = df1L1.reset_index(level=1).rename(columns={'level_1':'subject'})
print(df1L1B)

      subject  Sem1  Sem2
A01  Subject1    12    67
A01  Subject2    45    56
A02  Subject1    78    45
A02  Subject2    89    67
A03  Subject1    45    89
A03  Subject2    67    90
A04  Subject1    67    56
A04  Subject2    44    55

In [88]:
df1L1B.groupby('subject', as_index=True).agg(mean_Sem1 = ('Sem1','mean'), mean_Sem2 = ('Sem2', 'mean'))
# subject as index; calculate statistics later in aggregate

          mean_Sem1  mean_Sem2
subject
Subject1      50.50      64.25
Subject2      61.25      67.00

In [87]:
df1L1B.groupby('subject', as_index=False)[['Sem1','Sem2']].mean()
#no index, filter columns after group by

    subject   Sem1   Sem2
0  Subject1  50.50  64.25
1  Subject2  61.25  67.00

In [91]:
df1L1B[['Sem1','Sem2', 'subject']].groupby('subject', as_index=False).mean()
#filter columns first and then do group by

    subject   Sem1   Sem2
0  Subject1  50.50  64.25
1  Subject2  61.25  67.00

In [95]:
print(df1.head())

        Sem1              Sem2
    Subject1 Subject2 Subject1 Subject2
A01       12       45       67       56
A02       78       89       45       67
A03       45       67       89       90
A04       67       44       56       55

     Subject1  Subject2
A01      39.5      50.5
A02      61.5      78.0
A03      67.0      78.5
A04      61.5      49.5

In [96]:
df1.groupby(level=0, axis=1).mean()

     Sem1  Sem2
A01  28.5  61.5
A02  83.5  56.0
A03  56.0  89.5
A04  55.5  55.5

In [97]:
df1.groupby(level=1, axis=1).mean()

     Subject1  Subject2
A01      39.5      50.5
A02      61.5      78.0
A03      67.0      78.5
A04      61.5      49.5

In [102]:
df1.groupby(level=1, axis=1).groups.keys()

dict_keys(['Subject1', 'Subject2'])